#ifndef VMACROSES_H
#define VMACROSES_H


//=======================================================================================
/*  2018-12-13      by Elapidae
 *
 *  VMacroses введен, чтобы здесь собирать разные макроопределения, в первую очередь для
 *  определения компилятора и его версии.
 *
 *  Периодически всплывает задача отключить или переписать часть кода, например,
 *  для старого, или, наоборот, для нового компилятора.
*/
//=======================================================================================

#define V_GCC_VERSION ( __GNUC__ * 0x10000 \
                      + __GNUC_MINOR__ * 0x100 \
                      + __GNUC_PATCHLEVEL__ )

#define V_NOEXCEPT_SIGNATURE_WARNING_ENABLED ( V_GCC_VERSION >= 0x70300 )


#endif // VMACROSES_H
