#========================================================================================
# vcallback.cmake
#
#
# Этот файл сгенерирован автоматически.
#
# Вносить изменения можно между строк:
#   #<<< Start your code here
#   Сохраненный код.
#   #>>> Stop your code here
# Все остальные изменения будут перезаписаны.
#
#========================================================================================


#========================================================================================

if ( NOT  VCALLBACK_INCLUDED )
    set ( VCALLBACK_INCLUDED TRUE )

    message( "Include vcallback..." )

    #<<< Start your code here -----------------------------------------------------------
    #>>> Stop your code here ------------------------------------------------------------

    include_directories( "${VLIBS_DIR}/vcallback/")

    
    set(V_HEADERS ${V_HEADERS} "${VLIBS_DIR}/vcallback/vcallback.h") 
    

    message( "vcallback included" )

endif()
# vcallback.cmake
#========================================================================================
