#========================================================================================
# vsignal.cmake
#
#
# Этот файл сгенерирован автоматически.
#
# Вносить изменения можно между строк:
#   #<<< Start your code here
#   Сохраненный код.
#   #>>> Stop your code here
# Все остальные изменения будут перезаписаны.
#
#========================================================================================


#========================================================================================

if ( NOT  VSIGNAL_INCLUDED )
    set ( VSIGNAL_INCLUDED TRUE )

    message( "Include vsignal..." )

    #<<< Start your code here -----------------------------------------------------------
    #>>> Stop your code here ------------------------------------------------------------

    include_directories( "${VLIBS_DIR}/vsignal/")

    
    set(V_HEADERS ${V_HEADERS} "${VLIBS_DIR}/vsignal/vsignal.h") 
    

    message( "vsignal included" )

endif()
# vsignal.cmake
#========================================================================================
