#========================================================================================
# vcrc.cmake
#
#
# Этот файл сгенерирован автоматически.
#
# Вносить изменения можно между строк:
#   #<<< Start your code here
#   Сохраненный код.
#   #>>> Stop your code here
# Все остальные изменения будут перезаписаны.
#
#========================================================================================


#========================================================================================

if ( NOT  VCRC_INCLUDED )
    set ( VCRC_INCLUDED TRUE )

    message( "Include vcrc..." )

    #<<< Start your code here -----------------------------------------------------------
    include( "${VLIBS_DIR}/c++11/c++11.cmake" )
    #>>> Stop your code here ------------------------------------------------------------

    include_directories( "${VLIBS_DIR}/vcrc/")

    
    set(V_HEADERS ${V_HEADERS} "${VLIBS_DIR}/vcrc/vcrc.h") 
    
    set(V_SOURCES ${V_SOURCES} "${VLIBS_DIR}/vcrc/vcrc.cpp") 

    message( "vcrc included" )

endif()
# vcrc.cmake
#========================================================================================
