#========================================================================================
# vdir.cmake
#
#
# Этот файл сгенерирован автоматически.
#
# Вносить изменения можно между строк:
#   #<<< Start your code here
#   Сохраненный код.
#   #>>> Stop your code here
# Все остальные изменения будут перезаписаны.
#
#========================================================================================


#========================================================================================

if ( NOT  VDIR_INCLUDED )
    set ( VDIR_INCLUDED TRUE )

    message( "Include vdir..." )

    #<<< Start your code here -----------------------------------------------------------
    #>>> Stop your code here ------------------------------------------------------------

    include_directories( "${VLIBS_DIR}/vdir/")

    
    set(V_HEADERS ${V_HEADERS} "${VLIBS_DIR}/vdir/vdir.h") 
    
    set(V_SOURCES ${V_SOURCES} "${VLIBS_DIR}/vdir/vdir.cpp") 

    message( "vdir included" )

endif()
# vdir.cmake
#========================================================================================
