#ifndef VSYSLOGGER_H
#define VSYSLOGGER_H

#include <memory>
#include "vlogentry.h"

//=======================================================================================
namespace vlog
{
    //===================================================================================
    class VSysLogger final
    {
    public:
        static void open( const std::string &ident );
        static void register_self();
        static void execute( const VLogEntry &entry );

//        explicit VSysLogger( const std::string &ident );
//        ~VSysLogger();
//        void register_self();
//        void execute( const VLogEntry &entry );
//    private:
        // Зачем, см. описание [1] после класса.
//        std::unique_ptr<char[]> _ident;
    };
    //===================================================================================
} // namespace vlog
//=======================================================================================






//=======================================================================================
//  [1]
//      Описание из просторов интернета:
//
//  Аргумент ident при вызове openlog() сохраняется как есть. Поэтому, если
//  строка меняется, syslog() может начать добавлять уже изменённую строку.
//  Если строка перестаёт существовать, то это может привести к непредвиденным
//  результатам. Наиболее переносимый способ в данном случае --- использовать
//  строковую константу.
//
//=======================================================================================



#endif // VSYSLOGGER_H
