#ifndef VSYSLOGGER_H
#define VSYSLOGGER_H

#include "vlogentry.h"

//=======================================================================================
class VSysLogger final
{
public:
    static void open( const std::string &ident );
    static void register_self();
    static void execute( const VLogEntry &entry );
};
//=======================================================================================






//=======================================================================================
//  [1]
//      Описание из просторов интернета:
//
//  Аргумент ident при вызове openlog() сохраняется как есть. Поэтому, если
//  строка меняется, syslog() может начать добавлять уже изменённую строку.
//  Если строка перестаёт существовать, то это может привести к непредвиденным
//  результатам. Наиболее переносимый способ в данном случае --- использовать
//  строковую константу.
//
//=======================================================================================



#endif // VSYSLOGGER_H
