#========================================================================================
# error.cmake
#
#
# Этот файл сгенерирован автоматически.
#
# Вносить изменения можно между строк:
#   #<<< Start your code here
#   Сохраненный код.
#   #>>> Stop your code here
# Все остальные изменения будут перезаписаны.
#
#========================================================================================


#========================================================================================

if ( NOT  ERROR_INCLUDED )
    set ( ERROR_INCLUDED TRUE )

    message( "Include error..." )

    #<<< Start your code here -----------------------------------------------------------
    #>>> Stop your code here ------------------------------------------------------------

    include_directories( "${VLIBS_DIR}/error/")

    
    set(V_HEADERS ${V_HEADERS} "${VLIBS_DIR}/error/vgio_error.h") 
    
    set(V_SOURCES ${V_SOURCES} "${VLIBS_DIR}/error/vgio_error.cpp") 

    message( "error included" )

endif()
# error.cmake
#========================================================================================
