#========================================================================================
# vpoints.cmake
#
#
# Этот файл сгенерирован автоматически.
#
# Вносить изменения можно между строк:
#   #<<< Start your code here
#   Сохраненный код.
#   #>>> Stop your code here
# Все остальные изменения будут перезаписаны.
#
#========================================================================================


#========================================================================================

if ( NOT  VPOINTS_INCLUDED )
    set ( VPOINTS_INCLUDED TRUE )

    message( "Include vpoints..." )

    #<<< Start your code here -----------------------------------------------------------
    include( "${VLIBS_DIR}/c++11/c++11.cmake" )
    #>>> Stop your code here ------------------------------------------------------------

    include_directories( "${VLIBS_DIR}/vpoints/")

    
    set(V_HEADERS ${V_HEADERS} "${VLIBS_DIR}/vpoints/vpoints.h") 
    

    message( "vpoints included" )

endif()
# vpoints.cmake
#========================================================================================
