#========================================================================================
# vimage_zcm.cmake
#
# NB! Файл правлен ручками, постарайтесь не перегенерировать.
#
#========================================================================================


#========================================================================================

if ( NOT  VIMAGE_ZCM_INCLUDED )
    set ( VIMAGE_ZCM_INCLUDED TRUE )

    message( "Include vimage ZCM..." )

    #<<< Start your code here -----------------------------------------------------------
    include( "${VLIBS_DIR}/vimage/vimage.cmake" )
    #>>> Stop your code here ------------------------------------------------------------

    set(V_HEADERS ${V_HEADERS} "${VLIBS_DIR}/vimage/vimage_zcm.h")

    message( "vimage ZCM included" )

endif()
# vimage_zcm.cmake
#========================================================================================
