#========================================================================================
# vimage.cmake
#
# NB! Файл правлен ручками, постарайтесь не перегенерировать.
#
#========================================================================================


#========================================================================================

if ( NOT  VIMAGE_INCLUDED )
    set ( VIMAGE_INCLUDED TRUE )

    message( "Include vimage..." )

    #<<< Start your code here -----------------------------------------------------------
    #>>> Stop your code here ------------------------------------------------------------

    include_directories( "${VLIBS_DIR}/vimage/")

    
    set(V_HEADERS ${V_HEADERS} "${VLIBS_DIR}/vimage/vimage.h") 
    set(V_SOURCES ${V_SOURCES} "${VLIBS_DIR}/vimage/vimage.cpp") 

    message( "vimage included" )

endif()
# vimage.cmake
#========================================================================================
